In [19]:
import numpy as np

In [27]:
import pandas as pd

In [29]:
dict1 = {
    "name":["yash","ankit","anshul"],
    "marks":[89,56,96]
}

In [35]:
df = pd.DataFrame(dict1)

In [37]:
df

     name  marks
0    yash     89
1   ankit     56
2  anshul     96

In [39]:
df.to_csv('friends.csv')

In [41]:
df.head() ## to show starting rows

     name  marks
0    yash     89
1   ankit     56
2  anshul     96

In [43]:
df.tail(2)

     name  marks
1   ankit     56
2  anshul     96

In [45]:
df.describe() ## numerical cols ke stastics analsis

           marks
count   3.000000
mean   80.333333
std    21.361960
min    56.000000
25%    72.500000
50%    89.000000
75%    92.500000
max    96.000000

In [47]:
df.index=["a","b","c"]

In [49]:
df.head()

     name  marks
a    yash     89
b   ankit     56
c  anshul     96

# What is pandas : 
## Pandas is a open source data analysis library written in python.
## It leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientists
## it provides rich and highly robust data operations

## Pandas has 2 types of data structure : 
### a) Series - it is one dimesnional array with indexes,it stores a single cols or row od data in a Dataframe
### b) DataFrame : it is tabular spreadsheet like structure representing rows each of which  contains one or multiple cols